# 01. Import libraries

In [34]:
# import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Data
## Q3

In [35]:
# path folder
path = r'C:\\Users\alexp\Instacart Basket Analysis'
path

'C:\\\\Users\\alexp\\Instacart Basket Analysis'

In [36]:
# import df_merged_large.pkl
df_merged_large = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [37]:
# import products_checked.csv
df_prods_clean_no_dups = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = 0)

## Q4

In [38]:
# check the total size of df_merged_large.pkl
df_merged_large.shape

(32434489, 10)

## Q5

In [39]:
# check df_merged_large output
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [43]:
# drop column _merge in df_merged_large dataframe
df_merged_large = df_merged_large.drop(columns = ['_merge'])

In [44]:
# check updated df_merged_large dataframe
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [41]:
# check df_prods_clean_no_dups output
df_prods_clean_no_dups.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [47]:
# merge orders_products_combined.pkl and products_checked.csv
df_orders_products_large = df_merged_large.merge(df_prods_clean_no_dups, on = 'product_id', indicator = True)

In [48]:
df_orders_products_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

## Q6

In [49]:
# check merge flag frequency for df_orders_products_large
df_orders_products_large['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [50]:
# check total size for df_orders_products_large
df_orders_products_large.shape

(32404859, 14)

## Q7

In [51]:
# Export df_orders_products_large to pkl
df_orders_products_large.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))